# 3. Напишите программу, которая принимает на вход координаты точки
# (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка
# (или на какой оси она находится).
# Пример:
# x=34; y=-30 -> 4
# x=2; y=4 -> 1
# x=-34; y=-30 -> 3

x = int(input('Введите координаты точки Х: '))
y = int(input('Введите координаты точки Y: '))
while x == 0 or y == 0:
    print(f'Ты ввел цифорку нуль её кстати нельзя, давай еще разок')
    x = int(input('Введите координаты точки Х: '))
    y = int(input('Введите координаты точки Y: '))
if x > 0 and y > 0:
    print(f'Точка Х = {x}; Точка Y = {y} -> четверть в плоскости №1')
elif x < 0 and y > 0:
    print(f'Точка Х = {x}; Точка Y = {y} -> четверть в плоскости №2')
elif x < 0 and y < 0:
    print(f'Точка Х = {x}; Точка Y = {y} -> четверть в плоскости №3')
elif x > 0 and y < 0:
    print(f'Точка Х = {x}; Точка Y = {y} -> четверть в плоскости №4')